emacs/.emacs.d/readme.org
#+title: Kelsin's Emacs Config

* Introduction

* Early Init

#+begin_src emacs-lisp :tangle ./early-init.el
;;; early-init.el --- Early Init File

;; NOTE: early-init.el is now generated from readme.org.
;; Please edit that file instead

;; Defer garbage collection further back in the startup process
(setq kelsin-initial-gc-cons-threshold gc-cons-threshold)
(setq gc-cons-threshold 10000000)

;; Disable warnings
(setq byte-compile-warnings '(not obsolete))
(setq warning-suppress-log-types '((comp) (bytecomp)))
(setq native-comp-async-report-warnings-errors 'silent)

;; Disable package.el
(setq package-enable-at-startup nil)
(setq package-quickstart nil)

;; Change from the default 4k read process output max value
(setq read-process-output-max (* 1024 1024)) ;; 1mb

;; Resizing the Emacs frame can be a terribly expensive part of changing the
;; font. By inhibiting this, we easily halve startup times with fonts that are
;; larger than the system default.
(setq frame-inhibit-implied-resize t)

;; Silence stupid startup message
(setq inhibit-startup-echo-area-message (user-login-name))

;; Default frame configuration: full screen, good-looking title bar on macOS
(setq frame-resize-pixelwise t)
(tool-bar-mode -1)
(setq default-frame-alist '((fullscreen . maximized)
                            (vertical-scroll-bars . nil)
                            (horizontal-scroll-bars . nil)
			    (undecorated-round . t)

                            ;; Setting the face in here prevents flashes of
                            ;; color as the theme gets activated
                            (background-color . "#000000")
                            (foreground-color . "#ffffff")
                            (ns-appearance . dark)
                            (ns-transparent-titlebar . t)))

;; Disable GUI elements
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)

;; Prevent unwanted runtime builds in gccemacs (native-comp); packages are
;; compiled ahead-of-time when they are installed and site files are compiled
;; when gccemacs is installed.
(setq comp-deferred-compilation nil)
#+end_src

* Init

#+begin_src emacs-lisp :tangle ./init.el
;;; init.el --- Init File

;; NOTE: early-init.el is now generated from readme.org.
;; Please edit that file instead

;; User
(setq user-full-name "Christopher Giroir"
      user-mail-address "kelsin@valefor.com")

;; Restore gc settings after init
(add-hook 'after-init-hook '(lambda ()
                  (setq gc-cons-threshold (or kelsin-initial-gc-cons-threshold 800000))))
#+end_src

** Straight

#+begin_src emacs-lisp :tangle ./init.el

;; Assume :straight t for all use-package macros
(setq straight-use-package-by-default t)

;; Bootstrap straight
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
#+end_src

*** Use-Package

#+begin_src emacs-lisp :tangle ./init.el
;; Install use-package
(straight-use-package 'use-package)
#+end_src


** Generic Settings

#+begin_src emacs-lisp :tangle ./init.el
;;; Generic Settings

;; Custom File
(setq custom-file "~/.emacs.d/custom.el")
(load custom-file)

(setenv "LC_ALL" "en_US.UTF-8")
(setenv "LANG" "en_US.UTF-8")

;; Splash screen
(setq inhibit-splash-screen t)

;; Not needed
(setopt display-time-default-load-average nil)

;; Disable file dialogs
(setq use-file-dialog nil)

;; Smooth Scrolling
(pixel-scroll-precision-mode)

;; UTF-8
(prefer-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING))

;; Mac Settings
(if (and
     (eq system-type 'darwin)
     (featurep 'ns))
    (setq ns-alternate-modifier 'super
	  ns-command-modifier 'meta
	  ns-extended-platform-support-mode t
	  ns-pop-up-frames nil
	  ns-use-qd-smoothing nil))

;; Case Fold Search
(setq case-fold-search t)
(setq tags-case-fold-search t)

;; Enable special commands
(put 'set-goal-column 'disabled nil)
(put 'narrow-to-region 'disabled nil)
(put 'narrow-to-page 'disabled nil)
(put 'downcase-region 'disabled nil)
(put 'upcase-region 'disabled nil)
(put 'dired-find-alternate-file 'disabled nil)

;; Line numbers
(setq-default display-line-numbers-type 'relative
              display-line-numbers-current-absolute t
              display-line-numbers-width 4
              display-line-numbers-widen t)
(add-hook 'prog-mode-hook #'display-line-numbers-mode)

;; Yellow bar cursor
(add-to-list 'default-frame-alist '(cursor-type . bar))
(add-to-list 'initial-frame-alist '(cursor-type . bar))
(set-cursor-color "yellow")

;; Ansi colors for compilation output
(require 'ansi-color)
(defun colorize-compilation-buffer ()
  (ansi-color-apply-on-region compilation-filter-start (point)))
(add-hook 'compilation-filter-hook 'colorize-compilation-buffer)

;; Ansi colors in shell mode
(add-hook 'shell-mode-hook 'ansi-color-for-comint-mode-on)

;; Don't warn me about loading large files (TAGS files)
(setq large-file-warning-threshold nil)

;; Never use dialog windows
(setq use-dialog-box nil)

;; Set Shell to bash
(setq shell-file-name "/bin/bash")

(defun kelsin/add-to-path (item)
  "Add an item to both the PATH environment variable and the emacs exec-path variable"
  (interactive)
  (setenv "PATH" (concat (expand-file-name item) ":" (getenv "PATH")))
  (setq exec-path (split-string (getenv "PATH") path-separator)))
(kelsin/add-to-path "~/.nodenv/shims")
(kelsin/add-to-path "~/.rbenv/shims")
(kelsin/add-to-path "~/.pyenv/shims")
(kelsin/add-to-path "/usr/local/bin")
(kelsin/add-to-path "/opt/homebrew/bin")

;; Add a lisp folder and my functions package to the load path
(add-to-list 'load-path "~/.emacs.d/lisp/")
(add-to-list 'load-path "~/.emacs.d/kelsin/")

;; Don't prompt for compile commands and auto jump to first error
(setq compilation-read-command nil)
(setq compilation-auto-jump-to-first-error 't)
(setq compilation-scroll-output 'first-error)
(setq compilation-window-height 10)

;; Turn on column and line numbers in the mode line
(setq column-number-mode t)
(setq line-number-mode t)

;; Don't bother having to type yes ever
(fset 'yes-or-no-p 'y-or-n-p)

;; Truncate instead of wrapping lines
(set-default 'truncate-lines t)
(setq truncate-partial-width-windows 't)

;; Highlight where the marked region is
(setq transient-mark-mode t)

;; Fill test to 80 columns
(set-default 'fill-column 80)

;; Auto load compressed files correctly
(auto-compression-mode 1)

;; No annoying beep or flashes
(setq ring-bell-function 'ignore)

;; Scrolling
(setq
 scroll-margin 1
 scroll-step 1
 scroll-conservatively 10000
 scroll-preserve-screen-position 1)
(setq mouse-wheel-follow-mouse 't)
(setq mouse-wheel-scroll-amount '(1 ((shift) . 1)))

;; Enable recursive minibuffers
(setq enable-recursive-minibuffers t)

;; Hide commands in M-x which do not work in the current mode
(setq read-extended-command-predicate #'command-completion-default-include-p)

;; Expiration Date of Buffers
(setq clean-buffer-list-delay-general 1)

;; Diminish Mode
(use-package diminish)

;; Saving place in buffers
(use-package saveplace
  :config
  (save-place-mode 1))

;; Clean up startup and splash screen
(setq
 inhibit-splash-screen t
 inhibit-startup-echo-area-message t
 inhibit-startup-message t
 initial-scratch-message nil)

;; No backup files
(setq make-backup-files nil)

;; Set paren style
(show-paren-mode t)
(setq show-paren-style 'parenthesis)

;; Reindent then newline and indent
(global-set-key (kbd "M-RET") 'reindent-then-newline-and-indent)

;; No suspend in terminal
(global-unset-key (kbd "C-z"))

;; Set preferred code/tab style
(setq
 c-basic-offset 4
 c-offsets-alist '((substatement-open . 0)
		   (brace-list-open . 0)
		   (member-init-cont . 0)
		   (arglist-intro . +)
		   (arglist-close . 0)
		   (inlambda . 0)
		   (case-label . +)
		   (statement-case-open . 0))
 css-indent-offset 4
 mail-indentation-spaces 4
 ruby-indent-level 4
 sh-basic-offset 4
 tab-width 4
 lisp-backquote-indentation nil
 indent-tabs-mode nil)
(add-to-list 'auto-mode-alist '("\\.h\\'" . c++-mode))

;; Visible Bell
(setq visible-bell t)

;; Default to better frame titles
(setq frame-title-format
      (concat  "%b - emacs@" (system-name)))

;; Default to unified diffs
(setq diff-switches "-u")

;; Make files with #! at the beginning executable on save
(add-hook 'after-save-hook 'executable-make-buffer-file-executable-if-script-p)

;; WDired
(setq wdired-allow-to-change-permissions 't)

;; Disable VC
(setq vc-handled-backends nil)

;; Don't auto save
(setq auto-save-default nil)
(setq create-lockfiles nil)

;; Dired human readable
(setq dired-listing-switches "-alh")

;; Backup files into temp
(setq backup-directory-alist
      `((".*" . ,temporary-file-directory)))
(setq auto-save-file-name-transforms
      `((".*" ,temporary-file-directory t)))
#+end_src

** Theme and Font

#+begin_src emacs-lisp :tangle ./init.el
;;; Theme and Font
(setq-default line-spacing 3)
(add-to-list 'default-frame-alist '(font . "SauceCodePro Nerd Font Mono-18"))
;; (use-package base16-theme
;;   :config
;;   (load-theme 'base16-default-dark t))
;; (use-package modus-themes
;;   :config
;;   (load-theme 'modus-vivendi))
;; (use-package kaolin-themes
;;   :after all-the-icons
;;   :config
;;   (load-theme 'kaolin-aurora t)
;;   (kaolin-treemacs-theme))
(use-package emacs
  :config
  (load-theme 'modus-vivendi))
;; (add-to-list 'custom-theme-load-path "~/src/blizzard-colors/emacs")
;; (load-theme 'blizzard 't)
;; (use-package solarized-theme
;;     :config
;;     (load-theme 'solarized-dark t))
;; (use-package zenburn-theme
;;     :config
;;     (load-theme 'zenburn t))
;; (load-theme 'airbnb 't)
;; (use-package spacemacs-theme
;;     :config
;;     (load-theme 'spacemacs-dark t))

;; CtrlF
(use-package ctrlf
  :config
  (ctrlf-mode +1))

;; Mode Line
(use-package smart-mode-line
  :init
  (setq sml/theme 'dark)
  :config
  (sml/setup))
#+end_src

** Modes

*** Key Binding

#+begin_src emacs-lisp :tangle ./init.el
;; Which Key
(use-package which-key
  :diminish which-key-mode
  :config
  (which-key-mode))

;; General
(use-package general
  :config
  (general-evil-setup)

  (defun kelsin/devdocs (query)
    "Look up the provided search query in devdocs.io"
    (interactive "sQuery: ")
    (let ((url "http://devdocs.io/#q="))
      (browse-url (concat url (or query "")))))

  (defun kelsin/devdocs-at-point ()
    "Look up the word under cursor in devdocs.io"
    (interactive)
    (let ((url "http://devdocs.io/#q=")
          (query (or (if (region-active-p)
                         (buffer-substring-no-properties (region-beginning) (region-end))
                       (thing-at-point 'symbol))
                     "")))
      (browse-url (concat url query))))

  (general-define-key
   :states '(normal visual insert)
   :keymaps 'override
   :prefix "SPC"
   :non-normal-prefix "C-SPC"
   "B" '(:ignore t :which-key "bookmarks")
   "Bs" '(bookmark-set :which-key "set")
   "Bj" '(bookmark-jump :which-key "jump")
   "b" '(:ignore t :which-key "buffer")
   "br" '(revert-buffer :which-key "revert")
   "c" '(:ignore t :which-key "customize")
   "ca" '(customize-apropos :which-key "apropos")
   "cl" '(display-line-numbers-mode :which-key "line numbers")
   "ch" '(hl-line-mode :which-key "highlight current line")
   "d" '(dired-jump :which-key "dired")
   "g" '(:ignore t :which-key "go to")
   "gd" '(lsp-find-definition :which-key "definition")
   "gr" '(lsp-find-references :which-key "references")
   "ge" '(next-error :which-key "next error")
   "l" '(kelsin/devdocs-at-point :which-key "devdocs at point")
   "L" '(kelsin/devdocs :which-key "devdocs query")))
#+end_src

